[
  {
    "source": "Golf One Media",
    "title": "PGA of America Golf Names Derek Sprague CEO",
    "link": "https://golfonemedia.com/pga-of-america-golf-names-derek-sprague-ceo/",
    "published": "Fri, 20 Dec 2024 20:00:32 +0000",
    "summary": "<a href=\"https://golfonemedia.com/pga-of-america-golf-names-derek-sprague-ceo/\" rel=\"nofollow\" title=\"PGA of America Golf Names Derek Sprague CEO\"><img alt=\"Derek Sprague\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"446\" src=\"https://golfonemedia.com/wp-content/uploads/2024/12/derek_sprague-1-768x446.webp\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>The PGA of America has announced that Derek Sprague will succeed Seth Waugh as CEO, who held the positio",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "The PGA of America has named Derek Sprague as its new CEO, succeeding Seth Waugh who held the position for six years. Sprague, a past president of the PGA of America, has been a member since 1993 and has served in various roles including club General Manager of TPC Sawgrass in Ponte Vedra Beach, Florida, managing director of Liberty National Golf Club in Jersey City, New Jersey, and general manager and director of golf at Malone Golf Club in upstate New York. He will soon relocate to the PGA’s Frisco/Dallas Area headquarters from Florida.",
    "clubs_mentioned": [
      "1. TPC Sawgrass",
      "2. Liberty National Golf Club",
      "3. Malone Golf Club",
      "4. Augusta Ranch Golf Club"
    ]
  },
  {
    "source": "Golf One Media",
    "title": "Inside Jekyll Island’s Golf Comeback",
    "link": "https://golfonemedia.com/inside-jekyll-islands-golf-comeback/",
    "published": "Fri, 20 Dec 2024 16:58:52 +0000",
    "summary": "<a href=\"https://golfonemedia.com/inside-jekyll-islands-golf-comeback/\" rel=\"nofollow\" title=\"Inside Jekyll Island&#8217;s Golf Comeback\"><img alt=\"Jekyll Island\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"576\" src=\"https://golfonemedia.com/wp-content/uploads/2024/12/jekyll_island-768x576.webp\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>Uncover Jekyll Island's hidden golfing treasures. Play a round at Great Dunes, Oleander, Indian Mound, or Pine Lake",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "Jekyll Island, Georgia, once a popular golf destination, is undergoing a $20 million project to revitalize its golf courses. The project, led by the Jekyll Island Authority, includes reducing the number of holes from 63 to 54, renovating the Pine Lakes and Indian Mound courses, eliminating nine holes of the Oleander course, and combining the remaining nine with the Great Dunes nine to create a new Great Dunes course. The project is expected to have a positive financial impact across Jekyll Island, particularly at the Jekyll Island Club, the island’s premier resort. The renovated courses are expected to elevate the island's status from 'municipal' golf to 'resort' golf, making it a competitive golf destination.",
    "clubs_mentioned": [
      "1. Great Dunes Course",
      "2. Oleander Course",
      "3. Indian Mound Course",
      "4. Pine Lakes Course"
    ]
  },
  {
    "source": "Golf One Media",
    "title": "Birmingham, AL: History Comes Alive",
    "link": "https://golfonemedia.com/birmingham-al/",
    "published": "Thu, 19 Dec 2024 14:24:40 +0000",
    "summary": "<a href=\"https://golfonemedia.com/birmingham-al/\" rel=\"nofollow\" title=\"Birmingham, AL: History Comes Alive\"><img alt=\"Birmingham AL\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"412\" src=\"https://golfonemedia.com/wp-content/uploads/2024/12/birmingham_al-768x412.webp\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>Explore the historical treasures of Birmingham, AL. Immerse yourself in the city's rich past at the Birmingham Civil Rights Institute, Negro Sou",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "Highland Park Golf Course in Birmingham, Alabama, is a must-visit destination for golfers. Opened in 1903 as the nine-hole Birmingham Country Club, Highland Park is Alabama’s oldest golf course and one of the state’s top public layouts. The 5,800-yard, par 70 course, managed by Troon, offers great views of the downtown Birmingham skyline. Despite its short yardage, the course's narrow, rolling fairways and fast bentgrass greens make it a challenge for all but the best players. The course underwent a seven-month renovation in 1999, led by the late Bob Cupp, which mainly focused on its bunkers and greens. Highland Park receives approximately 50,000 rounds of play annually.",
    "clubs_mentioned": [
      "1. Highland Park Golf Course",
      "2. Birmingham Country Club",
      "3. Shoal Creek Club"
    ]
  },
  {
    "source": "Golf One Media",
    "title": "Bonita Bay Unveils Renovated Sabal Course",
    "link": "https://golfonemedia.com/bonita-bay/",
    "published": "Wed, 18 Dec 2024 11:00:00 +0000",
    "summary": "<a href=\"https://golfonemedia.com/bonita-bay/\" rel=\"nofollow\" title=\"Bonita Bay Unveils Renovated Sabal Course\"><img alt=\"Bonita Bay Club\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"575\" src=\"https://golfonemedia.com/wp-content/uploads/2023/02/bonita_bay-768x575.webp\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>Unveiling the latest upgrades at Bonita Bay Club's Naples campus. Discover the renovated golf courses, new performance centers, and rebuilt cl",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "Bonita Bay Club in Naples, Florida, has completed a series of master plan improvements, including the renovation of the Sabal golf course and the complete rebuild of the Naples Clubhouse. The Sabal course underwent a $16.5 million renovation led by Fazio Design Senior Design Associate Tom Marzolf, which took 16 months to complete. The club has also renovated the Cypress golf course and built two new golf performance centers since 2022. The newly rebuilt Naples Clubhouse, costing $12 million, now features a sleek, open design with expansive glass walls offering views of the surrounding landscapes and the 18th holes of the Cypress and Sabal courses. The dining areas, Pro Shop, and locker rooms have also been upgraded.",
    "clubs_mentioned": [
      "1. Bonita Bay Club",
      "2. Sabal Golf Course",
      "3. Cypress Golf Course"
    ]
  },
  {
    "source": "Golf One Media",
    "title": "Soleta Golf Club: Florida’s Newest Golfing Paradise",
    "link": "https://golfonemedia.com/soleta-golf-club/",
    "published": "Tue, 17 Dec 2024 23:00:00 +0000",
    "summary": "<a href=\"https://golfonemedia.com/soleta-golf-club/\" rel=\"nofollow\" title=\"Soleta Golf Club: Florida&#8217;s Newest Golfing Paradise\"><img alt=\"Soleta Golf Club\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"431\" src=\"https://golfonemedia.com/wp-content/uploads/2023/07/soleta_golf_club-768x431.webp\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>Discover Soleta Golf Club, designed by Nick Price: Florida's newest golfing paradise with eco-friendly features a",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "The Soleta Golf Club, a new golf course in Myakka City, Florida, officially opened on December 10, 2024. The course, designed by three-time major champion and World Golf Hall of Fame member Nick Price, emphasizes the land's natural beauty and features native white sands, rolling hills, and water hazards. The course was transformed from a former cattle ranch into a 7,415-yard, par-72 championship golf course. The club also offers a 30-acre David Leadbetter signature practice facility and indoor performance center, and plans to open a walking-only 9-hole short course in Spring 2025. The development around the golf course includes plans for 93 luxury residences, a clubhouse, and other amenities, with the first homes expected to be completed by November 2025.",
    "clubs_mentioned": [
      "1. Soleta Golf Club"
    ]
  },
  {
    "source": "Golf One Media",
    "title": "Quivira Golf Club: 10 Years of Nicklaus Genius",
    "link": "https://golfonemedia.com/quivira-golf-club/",
    "published": "Mon, 16 Dec 2024 18:22:21 +0000",
    "summary": "<a href=\"https://golfonemedia.com/quivira-golf-club/\" rel=\"nofollow\" title=\"Quivira Golf Club: 10 Years of Nicklaus Genius\"><img alt=\"Quivira Golf Club\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"278\" src=\"https://golfonemedia.com/wp-content/uploads/2024/12/quivira_golf_club-768x278.webp\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>Experience golfing at its finest at Quivira Golf Club in Los Cabos. Play on this world-class course designed by Jack Nick",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "Quivira Golf Club, a luxury golf course in Los Cabos, Mexico, is celebrating its 10th anniversary. The course, designed by Jack Nicklaus, features holes that play along the cliffs above the Sea of Cortez. Nicklaus described the course as diverse, with desert, ocean, and rock settings, and designed to be player-friendly yet challenging. Over the years, the course has undergone changes, including the reordering of holes and the construction of new ones. Despite these changes, Quivira has been internationally acclaimed and was recently ranked No. 3 in Golf Digest's list of the best golf courses in Mexico.",
    "clubs_mentioned": [
      "1. Quivira Golf Club"
    ]
  },
  {
    "source": "Golf One Media",
    "title": "KemperSports Adds Jersey Courses to Portfolio",
    "link": "https://golfonemedia.com/kempersports/",
    "published": "Mon, 16 Dec 2024 17:47:12 +0000",
    "summary": "<a href=\"https://golfonemedia.com/kempersports/\" rel=\"nofollow\" title=\"KemperSports Adds Jersey Courses to Portfolio\"><img alt=\"kempersports\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"425\" src=\"https://golfonemedia.com/wp-content/uploads/2024/12/kemper_sports-768x425.webp\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>KemperSports partners with Morris County Park Commission to manage prestigious golf courses in Northern New Jersey. </p>\n<p>Continue rea",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "KemperSports has entered into a new partnership with the Morris County Park Commission in New Jersey to manage four public golf courses: Berkshire Valley, Flanders Valley, Pinch Brook, and Sunset Valley. These courses are recognized as some of the state's finest. Berkshire Valley, opened in 2004, is located in the Highlands region of Northern New Jersey. Flanders Valley, located in Flanders, N.J., includes two 18-hole championship golf courses. Pinch Brook Golf Course, opened in 1983, is an executive-length golf course with a par-62, 5,000-yard layout. Sunset Valley Golf Course, opened in 1974 in Pompton Plains, New Jersey, is considered one of the best courses in the state. KemperSports now manages 16 golf courses, sports complexes, and athletic venues in New York and New Jersey.",
    "clubs_mentioned": [
      "1. Berkshire Valley",
      "2. Flanders Valley",
      "3. Pinch Brook",
      "4. Sunset Valley"
    ]
  },
  {
    "source": "Golf One Media",
    "title": "DS-ADAPT: Cobra Golf’s Newest Driver Fitting Technology",
    "link": "https://golfonemedia.com/ds-adapt/",
    "published": "Sun, 15 Dec 2024 21:15:49 +0000",
    "summary": "<a href=\"https://golfonemedia.com/ds-adapt/\" rel=\"nofollow\" title=\"DS-ADAPT: Cobra Golf&#8217;s Newest Driver Fitting Technology\"><img alt=\"DS-ADAPT\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"511\" src=\"https://golfonemedia.com/wp-content/uploads/2024/12/ds-adapt-768x511.webp\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>COBRA Golf's DS-ADAPT driver sets a new standard in club fitting. With its 33 adjustable loft and lie settings, it offers unparallele",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "Cobra Golf has introduced a new driver family, DS-ADAPT, featuring the company's innovative FUTUREFIT33 ADJUSTABLE HOSEL SYSTEM. This system allows for 33 unique loft and lie settings that can be adjusted independently, providing an unprecedented number of fitting options. The DS-ADAPT driver family includes four models: DS-ADAPT LS, DS-ADAPT X, DS-ADAPT MAX-K, and DS-ADAPT MAX-D, each designed for specific player types and featuring an internal ADAPTIVE WEIGHTING system. The drivers also feature SMARTPAD TECHNOLOGY, ensuring the clubface remains square at address regardless of the loft or lie set. The drivers are currently available for fitting and pre-sale and will be available at retail and online on Jan. 10, 2025.",
    "clubs_mentioned": [
      "1. DS-ADAPT LS",
      "2. DS-ADAPT X",
      "3. DS-ADAPT MAX-K",
      "4. DS-ADAPT MAX-D"
    ]
  },
  {
    "source": "Golf One Media",
    "title": "PGA TOUR Volunteer of the Year Announced",
    "link": "https://golfonemedia.com/pga-tour-volunteer-of-the-year-announced/",
    "published": "Sun, 15 Dec 2024 18:46:12 +0000",
    "summary": "<a href=\"https://golfonemedia.com/pga-tour-volunteer-of-the-year-announced/\" rel=\"nofollow\" title=\"PGA TOUR Volunteer of the Year Announced\"><img alt=\"PGA TOUR Volunteer\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"450\" src=\"https://golfonemedia.com/wp-content/uploads/2024/12/ken_hoffman_honored_as_2024_pga_tour_volunteer_of_the_year1-768x450.webp\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>Discover Ken Hoffman, the honored PGA TOUR Volunteer of the Y",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "Ken Hoffman, a volunteer at the Arnold Palmer Invitational for over 45 years, has been named the PGA TOUR Volunteer of the Year. In recognition of this honor, the TOUR will donate $10,000 to Hoffman’s chosen charity, The Arnold & Winnie Palmer Foundation, which is the primary beneficiary of the annual tournament in Orlando. Hoffman has served in various roles since 1979, including as a member of the volunteer executive board and the Volunteer General Chairman. He currently oversees the volunteers who support scoring on the new Volunteer Executive Leadership Team (VELT).",
    "clubs_mentioned": [
      "1. Arnold Palmer’s Bay Hill Club & Lodge"
    ]
  },
  {
    "source": "Golf One Media",
    "title": "Myrtle Beach Classic Wins “Best-in-Class Element” Award",
    "link": "https://golfonemedia.com/myrtle-beach-classic/",
    "published": "Sun, 15 Dec 2024 15:00:03 +0000",
    "summary": "<a href=\"https://golfonemedia.com/myrtle-beach-classic/\" rel=\"nofollow\" title=\"Myrtle Beach Classic Wins &#8220;Best-in-Class Element&#8221; Award\"><img alt=\"Myrtle Beach Classic\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"406\" src=\"https://golfonemedia.com/wp-content/uploads/2024/09/myrtle_beach_classic-768x406.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"768\" /></a><p>The PGA Tour has awarded the Myrtle Beach Classic the “Best-In-Class Element” award for its ",
    "fetch_date": "2024-12-22 10:18:33",
    "openai_summary": "The Myrtle Beach Classic has been awarded the \"Best-In-Class Element\" award by the PGA Tour for its innovative feature, The Q at Myrtle Beach. The award recognizes the inaugural Classic as a standout event of the Tour’s 2024 season for its audience engagement, creativity, and impact on the game. The Q at Myrtle Beach, conceptualized by Golf Tourism Solutions and Visit Myrtle Beach in partnership with the PGA TOUR, brought together 16 players, including eight prominent digital content creators, for an 18-hole shootout. The event was held at TPC Myrtle Beach and offered an opportunity to secure a sponsor exemption to the Myrtle Beach Classic. The Myrtle Beach Classic will be held on May 8-11, 2025, at the Dunes Golf and Beach Club.",
    "clubs_mentioned": [
      "1. TPC Myrtle Beach",
      "2. Dunes Golf and Beach Club"
    ]
  }
]